Autodesk.Revit.DB.Structure.AnalyticalLinkType.IsValidAnalyticalFixityState(Autodesk.Revit.DB.Structure.AnalyticalFixityState)
Returns whether the input fixity state is valid for Analytical Link Type parameters.
fixityState:
The fixity state value to check.
Returns:
True if valid.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalLinkType.RotationZ
Fixity of rotation around Z.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The fixity state rotationZ is not valid for Analytical Link Type parameters.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalLinkType.RotationY
Fixity of rotation around Y.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The fixity state rotationY is not valid for Analytical Link Type parameters.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalLinkType.RotationX
Fixity of rotation around X.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The fixity state rotationX is not valid for Analytical Link Type parameters.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalLinkType.TranslationZ
Fixity of translation along Z.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The fixity state translationZ is not valid for Analytical Link Type parameters.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalLinkType.TranslationY
Fixity of translation along Y.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The fixity state translationY is not valid for Analytical Link Type parameters.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalLinkType.TranslationX
Fixity of translation along X.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The fixity state translationX is not valid for Analytical Link Type parameters.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalLinkType
An object that specifies the analysis properties for an AnalyticalLink element.
Since:
2013